-- phpMyAdmin SQL Dump
-- version 4.6.5.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Июн 14 2017 г., 21:09
-- Версия сервера: 5.7.16
-- Версия PHP: 7.1.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `php2`
--

-- --------------------------------------------------------

--
-- Структура таблицы `authors`
--

CREATE TABLE `authors` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(100) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `authors`
--

INSERT INTO `authors` (`id`, `name`) VALUES
(1, 'Михайлов Алексей'),
(2, 'Селезнева Ольга'),
(3, 'Железняк Антон'),
(4, 'Белов Игорь'),
(5, 'Алексеева Анастасия');

-- --------------------------------------------------------

--
-- Структура таблицы `news`
--

CREATE TABLE `news` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `date` date NOT NULL,
  `author_id` bigint(20) UNSIGNED DEFAULT NULL,
  `header` varchar(255) NOT NULL,
  `text` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `news`
--

INSERT INTO `news` (`id`, `date`, `author_id`, `header`, `text`) VALUES
(1, '2017-06-14', 2, 'Засекреченная операционная система от Google заменит Android', '<p>В последние годы планы Google создать альтернативу Android перестали быть слухами и материализовались в ряд разработок. IT-гигант хочет не просто заменить самую популярную мобильную систему в мире, но и объединить ее с настольной Chrome OS. Именно поэтому без остановки ведется работа над сверхсекретной Fuchsia OS и подготовка к релизу Andromeda OS.</p>\r\n\r\n<p>Летом 2016 года на GitHub появился исходный код операционной системы под названием Fuchsia, созданной с нуля разработчиками Google. Что это такое и почему ее выложили в открытый доступ, никто не понял. Не прибавляло ясности и описание: «Розовый + фиолетовый = фуксия (новая операционная система)».</p>\r\n\r\n<p>Молчали и в Google — официального анонса или релиза не последовало.</p>\r\n\r\n<p>За «Фуксию» взялись энтузиасты. Они досконально изучили ОС. Самая главная ее особенность — она базируется на новом ядре Magenta, основанном на ОС под названием Little Kernel (LK), которая создавалась для встроенных устройств. Размер ядра не превышает 20 килобайт. LK разрабатывалась как раз для устройств, выполняющих конкретные задачи, но не нуждающихся в полноценной ОС.</p>\r\n\r\n<p>Все нынешние устройства от Google, будь то ноутбук на Chrome OS, Pixel на Android или же Chromecast, работают на ОС с ядром Linux. Оно не всегда идеально подходит для специализированного ПО, поэтому система может создаваться как раз для таких узких задач. Среди разработчиков, указанных на GitHub, значатся довольно видные эксперты в области встроенных систем.</p>\r\n\r\n<p>Согласно документации, Magenta предназначена для «современных телефонов и современных персональных компьютеров с быстрыми процессорами, большим количеством оперативной памяти с различными периферийными устройствами». Приложения для Fuchsia написаны с помощью пакета Flutter SDK от Google, который создавался для кросс-платформенной (iOS и Android) разработки приложений.</p>\r\n\r\n<p>Кроме того, ядро Magenta позволит системе эффективнее взаимодействовать с наиболее распространенными платформами интернета вещей, в том числе FreeRTOS и ThreadX. Таким образом, корпорация планирует усилить интеграцию компьютеров и мобильных устройств с домашними экосистемами.</p>\r\n\r\n<p>После детального изучения Fuchsia, стало очевидным и то, что система абсолютно универсальна. Она может работать как на умных часах, так и на смартфонах с планшетами и даже на компьютерах.</p>'),
(2, '2017-06-14', 4, 'Apple представила новую iOS', '<p>В рамках конференции WWDC 2017 корпорация Apple представила новые версии своих операционных систем, в том числе iOS 11. Прямая трансляция мероприятия доступна на сайте компании.</p>\r\n\r\n<p>В iOS появилась возможность отправлять деньги своим знакомым с помощью iMessage и Apple Pay. В компании оптимизировали использование пространства на устройстве: сообщения из мессенджера хранятся в iCloud, а фотографии и ролики меньше «весят» без потери качества.</p>\r\n\r\n<p>«Центр управления» системы получил полный редизайн. Теперь все пункты доступны на одном экране, а также имеется поддержка 3D Touch для вызова расширенного меню определенного пункта настроек. Незначительным изменениям подвергся экран блокировки и строка уведомлений.</p>\r\n\r\n<p>Также редизайн получил и магазин приложений App Store и теперь он похож на приложение «Музыка». Появились отдельные вкладки с играми, программами, изменилась страница описания приложений. Отдельно вынесены различные подборки, а также статьи с советами от кураторов.</p>\r\n\r\n<p>В системе появился особый режим «Не беспокоить за рулем». Он активируется автоматически, когда система распознает, что пользователь сел за руль. В таком случае смартфон показывает лишь черный экран, чтобы не отвлекать от дороги.</p>\r\n\r\n<p>Система станет доступна для установки осенью 2017 года.</p>'),
(3, '2017-06-14', 3, 'Доказана невозможность воскрешения динозавров', '<p>Палеонтологи из Манчестерского университета окончательно доказали, что невозможно воскресить динозавров по остаткам найденных в их костях белка. Об этом сообщается в пресс-релизе, опубликованном на сайте Phys.org.</p>\r\n\r\n<p>Ученые проанализировали следы коллагена в останках тираннозавра, чтобы выяснить, действительно ли органическое вещество принадлежало динозавру. Многие специалисты считали, что белок, обнаруженный в окаменевших костях древних ящеров, на самом деле является результатом загрязнения проб и принадлежит современным животным.</p>\r\n\r\n<p>Результаты исследования показали, что «ископаемый» коллаген соответствует коллагену, выделенного из костей страусов. Биополимеры (ДНК и белки) последних используются в исследованиях для определения эволюционных отношений между вымершими и ныне существующими организмами. Это опровергает точку зрения, согласно которой древние биополимеры, в том числе белки, могут содержаться в окаменелостях, возраст которых составляет десятки миллионов лет.</p>\r\n\r\n<p>Отсутствие в костях динозавров доисторических биологических молекул делает невозможным воссоздание ящеров с помощью методов биотехнологии.</p>'),
(4, '2017-06-14', 5, 'Обновление Windows 10 убило устройства пользователей', '<p>Компания Microsoft выпустила тестовую сборку Windows 10 под номером 16212 для участников программы Windows Insider, которая приводит к краху системы на мобильных устройствах. Портал MSPoweruser не рекомендует устанавливать новую версию ОС.</p>\r\n\r\n<p>Отмечается, что сборка была выпущена по ошибке и не предназначена для пользователей. Возможность установить обновление доступна как пользователям с поздним (Slow Ring) и ранним (Fast Ring) доступом к тестовым версиям системы. Также сообщается, что апдейт был доступен некоторым юзерам без доступа к Windows Insider.</p>\r\n\r\n<p>Обновление инициирует бесконечный цикл загрузок, тем самым выводя из строя смартфоны и планшеты на Windows 10. Для решения проблемы предлагается только полный сброс системы с помощью Windows Device Recovery Tool, что приведет к удалению файлов и обнуление настроек. На компьютерах со сборкой 16212 подобных проблем замечено не было, но устанавливать ее все равно не рекомендуется.</p>\r\n\r\n<p>Windows Insider Program — программа предварительной оценки обновлений Windows 10 до их официального выхода, запущенная в сентябре 2014 года. В 2015 году она стала доступна для мобильных устройств.</p>'),
(5, '2017-06-14', NULL, 'Автопилот Tesla назвали убийцей велосипедистов', '<p>Эксперт по робототехнике Хизер Найт (Heather Knight) изучила принцип работы автопилота электрокаров Tesla и пришла к заключению, что он может быть опасен для велосипедистов. Статью под названием «Обзор автопилота Tesla: Велосипедисты умрут» специалист опубликовала в своем блоге на Medium.</p>\r\n\r\n<p>Найт пояснила, что целью ее поста изначально являлось желание поделиться первыми впечатлениями от системы. Однако в процессе использования автопилота она заметила, что машина ведет себя странно при приближении велосипедистов. По ее словам, Tesla не понимает, что перед ней человек, и воспринимает велосипед как маленький автомобиль.</p>\r\n\r\n<p>«Невозможность определить объект не говорит о том, что Tesla его не видит. Но, когда на кону человеческая жизнь, мы рекомендуем никогда не использовать автопилот Tesla возле велосипедистов», — заключила Найт.</p>\r\n\r\n<p>Ученый положительно оценила остальные качества системы автономного вождения Tesla. По ее словам, машина отлично перестраивается из полосы в полосу без участия водителя, но порой слишком поздно заходит на поворот.</p>\r\n\r\n<p>Tesla объявила о начале производства автомобилей с системой полного автопилота в конце октября 2016-го. На машину потребуется установить 8 камер с обзором 360 градусов, а также 12 ультразвуковых сенсоров и фронтальный радар. Подобным оборудованием уже оснащаются Model S и X. Отмечается, что внедрение новой системы позволит снизить затраты на транспортировку машин.</p>'),
(35, '2017-06-14', 1, 'Слуцкий назначен главным тренером английского «Халл Сити»', '<p>Бывший главный тренер московского ЦСКА и сборной России по футболу Леонид Слуцкий возглавил английский «Халл Сити». Об этом сообщается на сайте «тигров».</p>\r\n<p>«Очень надеюсь, что мы вернемся в премьер-лигу. Я уже знаю, что это известный клуб с преданными болельщиками. Не могу дождаться, когда приступлю к работе на следующей неделе», — рассказал Слуцкий.</p>\r\n<p>О длительности контракта со специалистом и финансовых деталях соглашения не сообщается.</p>\r\n<p>Спортивный комментатор Виктор Гусев рассказал Национальной службе новостей (НСН), что Слуцкий серьезно готовился к своей новой работе — по восемь часов в день учил английский язык.</p>\r\n<p>В прошедшем сезоне команда «Халл Сити» заняла 18-е место в английской премьер-лиге и вылетела во второй по силе дивизион чемпионата страны.</p>\r\n<p>Последним местом работы 46-летнего тренера был ЦСКА. Он проработал в московском клубе с 2009 по 2016 год, завоевав с командой семь трофеев. Тренер ушел в отставку в декабре 2016 года.</p>'),
(47, '2017-06-14', NULL, 'Астраханский наркоман попытался скрыться от полиции на велосипеде', '<p>Сотрудники уголовного розыска в городе Харабали (Астраханская область) задержали местного жителя, который перевозил на велосипеде около полукилограмма конопли. Об этом в пятницу, 9 июня, сообщает пресс-служба МВД России.</p>\r\n\r\n<p>Внимание стражей порядка привлекло подозрительное поведение велосипедиста — он постоянно оглядывался по сторонам. Мужчина проигнорировал требование об остановке, выбросил на землю пакет, висевший на руле, и свернул в жилой сектор, пытаясь скрыться от преследования.</p>\r\n\r\n<p>«Впоследствии оперативникам удалось задержать его и выяснить причину странного поведения. В пакете, от которого мужчина хотел незаметно избавиться, находились листья и верхушечные части дикорастущей конопли», — говорится в сообщении. По данным экспертов-криминалистов, общая масса наркотика составила 428 граммов.</p>\r\n\r\n<p>Задержанный — ранее судимый за кражу местный житель 1987 года рождения — признался полицейским, что собирался употребить марихуану сам во время отпуска. В отношении велосипедиста возбуждено уголовное дело по факту незаконного приобретения и хранения наркотического средства в крупном размере.</p>\r\n\r\n<p>5 июня управление Следственного комитета России (СКР) по Санкт-Петербургу сообщило, что днем 4 июня в Шуваловском парке города 32-летний местный житель на велосипеде наехал на ребенка, который скончался на месте происшествия от полученных телесных повреждений.</p>');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `authors`
--
ALTER TABLE `authors`
  ADD KEY `fk_news_author_idx` (`id`);

--
-- Индексы таблицы `news`
--
ALTER TABLE `news`
  ADD UNIQUE KEY `id` (`id`),
  ADD KEY `fk_news_author` (`author_id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `authors`
--
ALTER TABLE `authors`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;
--
-- AUTO_INCREMENT для таблицы `news`
--
ALTER TABLE `news`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=69;
--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `news`
--
ALTER TABLE `news`
  ADD CONSTRAINT `fk_news_author` FOREIGN KEY (`author_id`) REFERENCES `authors` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
